app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
	def show
		@projects=Project.all

INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('oei5tj', 'jonio', '2018-03-09 05:42:58', '2018-03-09 05:42:58')
---
	def iproject
		@project = Project.new(:title=>params[:title],:description=>params[:description])
		if @project.save

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 3
---
	def delete
		@project=Project.find(params[:id])
		if @project.destroy

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
	def edit
	 @project=Project.find(params[:id])

INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Online Fruits shopping', 'About Fruits', '2018-02-27 10:12:05', '2018-02-27 10:12:05')
---
	def create
		@project = Project.new(project_params)
		if @project.save

SELECT `projects`.* FROM `projects`
---
	def showtasks
		@projects=Project.all

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
UPDATE `projects` SET `title` = 'Online Iphone shopping', `updated_at` = '2018-02-28 09:47:19' WHERE `projects`.`id` = 1
---
	def updateproject
		@project=Project.find(params[:project][:id])
		if @project.update_attributes(project_params)

SELECT `projects`.* FROM `projects`
SELECT SUM(`tasks`.`hours`) FROM `tasks` WHERE `tasks`.`taskdate` = '2018-03-06'
INSERT INTO `tasks` (`title`, `description`, `hours`, `taskdate`, `project_id`, `created_at`, `updated_at`) VALUES ('e5ruhy`','oih','1','2018-03-21','1','2018-03-13 11:23:06','2018-03-13 11:23:06'),('oihj','oih','1','2018-03-21','1','2018-03-13 11:23:06','2018-03-13 11:23:06'),('oiuh','oih','1','2018-03-21','1','2018-03-13 11:23:06','2018-03-13 11:23:06')
---
	def updateajax
			@tasks=params.require(:project).permit(tasks_attributes:[:project_id,:title,:description,:hours,:taskdate])
			taskdate=params[:obj][:taskdate]
			sum=0
			@errors=Array.new()
			flag=false
			@tasks.each { |key,value|
				value.each { |key1,j|
	  			 # @task=Task.new(j)
	      	 #  unless @task.valid?
					 # 			 @task.errors.full_messages.each do |i|
				 	 # 				 @errors<<i
				 	 #  		  end
				 	 #  flag=true
				 	 #  break
				 	 # end
				 	sum+=j["hours"].to_i
				}
			}
			remaining=8-Task.where(:taskdate => taskdate).sum(:hours)
			if sum > 8 || sum > remaining || flag
				 @errors<<"Total Hours should be not exceed 8 hours." if sum > 8
				 if sum > remaining
						if remaining > 0
								 @errors<<"Your Task date #{@taskdate} had only #{remaining} remaining hours"